tutorials/conjugateHeatTransfer/flowOverHeatedPlate/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application 		multiRegionFoam;
startFrom       	latestTime;
startTime       	0;
stopAt          	endTime;
endTime         	1;
deltaT          	1E-2;
writeControl    	timeStep;
writeInterval   	1;
purgeWrite      	0;
writeFormat     	ascii;
writePrecision  	8;
writeCompression 	uncompressed;
timeFormat      	general;
timePrecision   	10;
runTimeModifiable 	yes;

// ************************************************************************* //
