tutorials/conjugateHeatTransfer/flowOverHeatedPlate/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-15;
        relTol          0;
        minIter         2;
        maxIter         250;
    };

    Tcoupled
    {
        solver           BiCGStab;
        
        preconditioner      
        {                   
            preconditioner  Cholesky;
        }

        tolerance        1e-15;
        relTol           0;

        minIter          0;
        maxIter          200;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 3;

    residualControl
    {
        T               1e-7;
    }
}

PISO
{
    pRefPoint (0 0 0); 
    pRefValue 0;
}

PIMPLE
{
    // p-U coupling
    //nOuterCorrectors            3; // SIMPLEC loops, see constant/fvSolution
    nCorrectors                 2; // PISO loops
    nNonOrthogonalCorrectors    1;

    residualControl
    {
        p
        {
            relTol         0;
            tolerance      0;
        }

        U
        {
            relTol         0;
            tolerance      0;
        }
    }
}

relaxationFactors
{
	T	1.0;
}



// ************************************************************************* //
